In [2]:
import pandas as pd
import numpy as np

import lib.data_handler as dh

In [3]:
%load_ext autoreload
%autoreload 2

### **Load Data**

In [4]:
df_links = dh.load_csv_data("./data/links.csv")

df_movies = dh.load_csv_data("./data/movies.csv")

df_ratings = dh.load_csv_data("./data/ratings.csv")

df_tags = dh.load_csv_data("./data/tags.csv")

Data loaded successfully from ./data/links.csv.
Data loaded successfully from ./data/movies.csv.
Data loaded successfully from ./data/ratings.csv.
Data loaded successfully from ./data/tags.csv.

In [5]:
display(df_links.head())

display(df_movies.head())

display(df_ratings.head())

display(df_tags.head())

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

### **Data Analysis**

#### **Links**

In [20]:
summary = dh.descriptive_analysis(df_links)

display(summary["numerical"])

display(summary["categorical"])

             movieId        imdbId         tmdbId
count    9742.000000  9.742000e+03    9734.000000
mean    42200.353623  6.771839e+05   55162.123793
std     52160.494854  1.107228e+06   93653.481487
min         1.000000  4.170000e+02       2.000000
25%      3248.250000  9.518075e+04    9665.500000
50%      7300.000000  1.672605e+05   16529.000000
75%     76232.000000  8.055685e+05   44205.750000
max    193609.000000  8.391976e+06  525662.000000

Empty DataFrame
Columns: []
Index: []

#### **Movies**

In [16]:
summary = dh.descriptive_analysis(df_movies)

display(summary["numerical"])

display(summary["categorical"])

             movieId
count    9742.000000
mean    42200.353623
std     52160.494854
min         1.000000
25%      3248.250000
50%      7300.000000
75%     76232.000000
max    193609.000000

                                                 title genres
unique_values                                     9737    951
top_value       Confessions of a Dangerous Mind (2002)  Drama
top_frequency                                        2   1053
missing_values                                       0      0

#### **Ratings**

In [18]:
summary = dh.descriptive_analysis(df_ratings)

display(summary["numerical"])

display(summary["categorical"])

              userId        movieId         rating     timestamp
count  100836.000000  100836.000000  100836.000000  1.008360e+05
mean      326.127564   19435.295718       3.501557  1.205946e+09
std       182.618491   35530.987199       1.042529  2.162610e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.019124e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8122.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09

Empty DataFrame
Columns: []
Index: []

In [26]:
# unique userIDs
print(len(df_ratings["movieId"].unique()))

9724

#### **Tags**

In [17]:
summary = dh.descriptive_analysis(df_tags)

display(summary["numerical"])

display(summary["categorical"])

            userId        movieId     timestamp
count  3683.000000    3683.000000  3.683000e+03
mean    431.149335   27252.013576  1.320032e+09
std     158.472553   43490.558803  1.721025e+08
min       2.000000       1.000000  1.137179e+09
25%     424.000000    1262.500000  1.137521e+09
50%     474.000000    4454.000000  1.269833e+09
75%     477.000000   39263.000000  1.498457e+09
max     610.000000  193565.000000  1.537099e+09

                             tag
unique_values               1589
top_value       In Netflix queue
top_frequency                131
missing_values                 0

In [23]:
mask = (df_tags["userId"] == 2)

display(df_tags[mask])

   userId  movieId                tag   timestamp
0       2    60756              funny  1445714994
1       2    60756    Highly quotable  1445714996
2       2    60756       will ferrell  1445714992
3       2    89774       Boxing story  1445715207
4       2    89774                MMA  1445715200
5       2    89774          Tom Hardy  1445715205
6       2   106782              drugs  1445715054
7       2   106782  Leonardo DiCaprio  1445715051
8       2   106782    Martin Scorsese  1445715056